package com.gemini.task;

import java.util.HashMap;
import java.util.Map;

/**
 * @author Re-zero
 * @version 1.0
 */
public class Task18 {
    /*
    Task 18：喜新厌旧 (Map.put 的返回值)
对应进度：P530 (Map常用方法) 背景： 我们都知道 map.put(k, v) 是添加。
 但如果 Key 已经存在了，它会执行“替换”操作。 此时，put 方法其实是有返回值的！
 它会把被踢走的那个旧 Value 返回给你（让你死个明白）。
     */
    public static void main(String[] args) {
        Map map = new HashMap();
        map.put("No1", "张三"); // 第1次放 No1
        Object v1 = map.put("No1", "李四"); // 第2次放 No1，把张三挤走了

        System.out.println(v1);
// 问：v1 的值是什么？ 李四
// A. "李四" (新的值)
// B. "张三" (被挤走的旧值)
// C. null
// D. true

//        Task 18：喜新厌旧 (put 的返回值)
//        你的答案：A ("李四")
//        正确答案：B ("张三") 👈 这里要注意！
//        解析： map.put(key, value) 的设计哲学是：
//        “我把你原来的东西替下来了，为了怕你有用，我把它还给你。”
//        如果是第一次存（没有旧值），返回 null.
//        如果是替换（有旧值），返回被覆盖掉的那个旧值。
//        (这也是为什么有些代码会用 if (map.put(...) != null)
//        来判断 key 以前是否存在。)
    }
}
